# GetPoints Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TopographySurface..::..GetPoints Method
TopographySurface Class See Also
---
Gets the points that define this topography surface.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<XYZ> GetPoints()
```

Visual Basic
---
```text
Public Function GetPoints As IList(Of XYZ)
```

Visual C++
---
```text
public:
IList<XYZ^>^ GetPoints()
```

# ### Return Value
The collection of points.
# Remarks
This applies to TopographySurface, SiteSubRegion, and the topography surface associated with a BuildingPad element. For a SiteSubRegion, this returns the points from a representation of the region's boundary as well as the points inherited from the host TopographySurface. For the topography surface associated with a BuildingPad element, this returns the points from the sketch of this topography surface(there are no interior points for this topography surface).
# See Also
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace